groups = [
    ["математика (профиль)", "физика"],
    ["математика (профиль)", "иностранный язык"],
    ["математика (профиль)", "информатика и икт"],
    ["математика (профиль)", "химия"],
    ["математика (профиль)", "обществознание"],
    ["математика (профиль)", "биология"],
    ["математика (профиль)", "география"],
    ["математика (профиль)", "история"],
    ["история", "обществознание"],
    ["история", "иностранный язык"],
    ["история", "литература"],
    ["иностранный язык", "литература"],
    ["химия", "биология"],
    ["обществознание", "биология"]
]

spheres = {
    "техника": [0, 1, 2, 3],
    "точные науки": [0, 2, 3],
    "гуманитарные науки": [8, 9, 10, 11],
    "медицина": [0, 2, 3, 4, 5, 12, 13, 14],
    "искусство": [8, 9, 10, 11],
    "социальная сфера": [8, 9, 10, 11],
    "естественные науки": [0, 3, 5, 6, 7],
    "радиотехника": [0, 1, 2],
    "it": [0, 1, 2],
    "аграрная сфера": [0, 1, 2, 6],
    "образование": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
}
